Revit 2024 API
GeomCombinationSetIterator Class
An iterator to a GeomCombination set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public abstract class GeomCombinationSetIterator : APIObject,
	IEnumerator
Visual Basic
Public MustInherit Class GeomCombinationSetIterator _
	Inherits APIObject _
	Implements IEnumerator
Visual C++
public ref class GeomCombinationSetIterator abstract : public APIObject,
	IEnumerator
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.GeomCombinationSetIterator
See Also
GeomCombinationSetIterator Members
Autodesk.Revit.DB Namespace